#+TITLE:    s-expression-syntax README
#+AUTHOR:   Jan Moringen
#+EMAIL:    jmoringe@techfak.uni-bielefeld.de
#+LANGUAGE: en

#+OPTIONS: toc:t num:nil
#+SEQ_TODO: TODO STARTED | DONE

#+BEGIN_SRC lisp :exports both :results silent
  (ql:quickload :s-expression-syntax)
#+END_SRC

** STARTED Part Protocol

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:name 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   name THING

   Return the name of THING.

   If THING is syntax description [...]

   If THING is a part, the name is a symbol which uniquely identifies the
   part within the containing syntax description.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:cardinality 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   cardinality PART

   Return cardinality of sub-expression(s) described by PART.

   The following values may be returned

   ? The described sub-expression occurs zero or one times in the
   containing expression.

   1 The described sub-expression occurs exactly once in the containing
   expression.

   * The described sub-expression occurs zero or more times in the
   containing expression.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:evaluation 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   evaluation PART

   Return evaluation semantics of sub-expressions described by PART.
   #+end_example

** STARTED Syntax Description Protocol

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:part-not-found-error 'type)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   part-not-found-error
   Precedence List: error, serious-condition, condition, t

   This error is signaled if a specified part cannot be found in a given
   syntax description.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:name 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   name THING

   Return the name of THING.

   If THING is syntax description that describes a standard special
   operator, macro, class or type, the returned name is the symbol in the
   COMMON-LISP package which names the special operator, macro, class or
   type.

   If THING is a part [...]
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:parts 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   parts CONTAINER

   Return a sequence of parts belonging to CONTAINER.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:find-part 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   find-part NAME CONTAINER &KEY IF-DOES-NOT-EXIST

   Return the part of CONTAINER named NAME.

   IF-DOES-NOT-EXIST controls the behavior in case a part named NAME does
   not exist in CONTAINER.

   If the value of IF-DOES-NOT-EXIST is a function, that function is
   called with a single argument, a condition of type
   `part-not-found-error'.

   If the value of IF-DOES-NOT-EXIST is not a function, that value is
   returned in place of the missing part.
   #+end_example

** STARTED Syntax Description Repository Protocol

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:syntax-not-found-error 'type)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   syntax-not-found-error
   Precedence List: error, serious-condition, condition, t

   This error is signaled if a specified syntax cannot be found.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:find-syntax 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   find-syntax NAME &KEY IF-DOES-NOT-EXIST

   Return the syntax description named NAME, if any.

   IF-DOES-NOT-EXIST controls the behavior in case a syntax description
   named NAME does not exist. The following values are allowed:

   #'ERROR

   Signal an error if a syntax description named NAME does not exist.

   OBJECT

   Return OBJECT if a syntax description named NAME does not exist.
   #+end_example

** STARTED Parse Protocol

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:invalid-syntax-error 'type)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   [condition-class] invalid-syntax-error
   Precedence List: error, serious-condition, condition, t

   NIL
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax::classify 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   classify CLIENT EXPRESSION

   Classify EXPRESSION, possibly according to specialized behavior of CLIENT.

   Return a syntax description object that roughly reflects the kind of
   EXPRESSION. Note that a precise classification would have to take into
   account aspects beyond the syntax, such as the environment, to, for
   example, distinguish function and macro application or variable
   references and symbol macro applications. It should always be possible
   to find an appropriate syntax description:

   + If EXPRESSION is a special form, this function returns the syntax
   description for the corresponding special operator.

   + If EXPRESSION is an application of a standard macro, this function
   returns the syntax description for that macro.

   + If EXPRESSION a list not covered by the above cases, this function
   returns the syntax description for a generic (that is, function or
   macro) application. Note that this case also covers invalid
   applications such as (1 2 3).

   + If EXPRESSION is a symbol but not a keyword, this function returns a
   syntax description for a variable reference.

   + If EXPRESSION is any object that is not covered by the above cases,
   this function returns a syntax description for a self-evaluating
   object.
   #+end_example

   #+BEGIN_SRC lisp :results value :exports results :session "doc"
     (doc 's-expression-syntax:parse 'function)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   parse CLIENT SYNTAX EXPRESSION

   Parse EXPRESSION according to SYNTAX, possibly specialized behavior of CLIENT.

   TODO
   #+end_example

# Local Variables:
# eval: (require 'ob-lisp)
# End:
